
&НаСервере
Процедура ОтправитьСообщениеНаСервере(Текст)
	Ответ = ВКМ_Телеграм.ОтправитьСообщение(Текст).ПолучитьТелоКакСтроку();

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ);
	СодержимоеОтвета = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	   
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,Символы.Таб));
   	ЗаписатьJSON(Запись, СодержимоеОтвета,);
	ОтветСервера = Запись.Закрыть()
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере(Текст);
КонецПроцедуры
