// нач Блохин Новые процедуры	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ВКМ_ДатаНачалаДействияДоговора = Неопределено;
		ВКМ_ДатаОкончанияДействияДоговора = Неопределено;
		ВКМ_СтоимостьЧасаРаботы = Неопределено;
		ВКМ_СуммаАбонентскойПлаты = Неопределено;
	КонецЕсли;

КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ)
	
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Если ВКМ_ДатаОкончанияДействияДоговора < ВКМ_ДатаНачалаДействияДоговора Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Дата начала действия договора меньше даты окончания!'"));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
#КонецОбласти
#КонецЕсли
// кон Блохин Новые процедуры	